app/controllers/issues_controller.rb

  def index
    retrieve_query
    sort_init(@query.sort_criteria.empty? ? [['id', 'desc']] : @query.sort_criteria)
    sort_update({'id' => "#{Issue.table_name}.id"}.merge(@query.available_columns.inject({}) {|h, c| h[c.name.to_s] = c.sortable; h}))

    if @query.valid?
      limit = per_page_option
      respond_to do |format|
        format.html { }
        format.atom { }
        format.csv  { limit = Setting.issues_export_limit.to_i }
        format.pdf  { limit = Setting.issues_export_limit.to_i }
      end
      @issue_count = Issue.count(:include => [:status, :project], :conditions => @query.statement)
      @issue_pages = Paginator.new self, @issue_count, limit, params['page']
      @issues = Issue.find :all, :order => [@query.group_by_sort_order, sort_clause].compact.join(','),
        :include => [ :assigned_to, :status, :tracker, :project, :priority, :category, :fixed_version ],
        :conditions => @query.statement,
        :limit  =>  limit,
        :offset =>  @issue_pages.current.offset
---
SELECT `projects`.* FROM `projects` INNER JOIN members ON projects.id = members.project_id WHERE ((`members`.user_id = 2) AND ((projects.status=1)))
SELECT count(DISTINCT `issues`.id) AS count_all FROM `issues` LEFT OUTER JOIN `issue_statuses` ON `issue_statuses`.id = `issues`.status_id LEFT OUTER JOIN `projects` ON `projects`.id = `issues`.project_id WHERE ((issues.tracker_id IN ('13')) AND (issue_statuses.is_closed=0) AND projects.id = 3 AND ((projects.status=1 AND EXISTS (SELECT em.id FROM enabled_modules em WHERE em.name='issue_tracking' AND em.project_id=projects.id)) AND (1=0 OR projects.is_public = 1)))
SELECT * FROM `versions` WHERE (`versions`.project_id = 2) ORDER BY versions.effective_date DESC, versions.name DESC
SELECT count(*) AS count_all FROM `versions` WHERE (`versions`.project_id = 2)

  def show
    @journals = @issue.journals.find(:all, :include => [:user, :details], :order => "#{Journal.table_name}.created_on ASC")
---
SELECT * FROM `journals` WHERE (`journals`.journalized_id = 7 AND `journals`.journalized_type = 'Issue') ORDER BY journals.created_on ASC
SELECT `users`.* FROM `users` INNER JOIN watchers ON users.id = watchers.user_id WHERE ((`watchers`.watchable_id = 7) AND (`watchers`.watchable_type = 'Issue'))

  def new
    @issue = Issue.new
    @issue.copy_from(params[:copy_from]) if params[:copy_from]
    @issue.project = @project
    # Tracker must be set before custom field values
    @issue.tracker ||= @project.trackers.find((params[:issue] && params[:issue][:tracker_id]) || params[:tracker_id] || :first)
    if @issue.tracker.nil?
      render_error I18n.t(:error_no_tracker_in_project)
      return
    end
    if params[:issue].is_a?(Hash)
      @issue.attributes = params[:issue]
      @issue.watcher_user_ids = params[:issue]['watcher_user_ids'] if User.current.allowed_to?(:add_issue_watchers, @project)
    end
    @issue.author = User.current

    default_status = IssueStatus.default
    unless default_status
      render_error I18n.t(:error_no_default_status_in_project)
      return
    end
    @issue.status = default_status
    @allowed_statuses = ([default_status] + default_status.find_new_statuses_allowed_to(User.current.roles_for_project(@project), @issue.tracker)).uniq

    if request.get? || request.xhr?
      @issue.start_date ||= Date.today
    else
      requested_status = IssueStatus.find_by_id(params[:issue][:status_id])
      # Check that the user is allowed to apply the requested status
      @issue.status = (@allowed_statuses.include? requested_status) ? requested_status : default_status
      if @issue.save
---
SELECT * FROM `issues` WHERE (project_id=2) ORDER BY subject
SELECT `projects`.* FROM `projects` INNER JOIN members ON projects.id = members.project_id WHERE ((`members`.user_id = 1) AND ((projects.status=1)))
SELECT `trackers`.id FROM `trackers` INNER JOIN `projects_trackers` ON `trackers`.id = `projects_trackers`.tracker_id WHERE (`trackers`.`id` = 13) AND (`projects_trackers`.project_id = 2 ) ORDER BY trackers.position LIMIT 1
SELECT * FROM `issue_statuses` WHERE (`issue_statuses`.`id` = '17') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.status = 1)
SELECT * FROM `watchers` WHERE (`watchers`.watchable_id = 82 AND `watchers`.watchable_type = 'Issue')
SELECT `roles`.* FROM `roles` INNER JOIN member_roles ON roles.id = member_roles.role_id WHERE ((`member_roles`.member_id = 3))
SELECT `users`.id FROM `users` INNER JOIN watchers ON users.id = watchers.user_id WHERE ((`watchers`.watchable_id = NULL) AND (`watchers`.watchable_type = 'Issue'))
INSERT INTO `issues` (`start_date`, `estimated_hours`, `priority_id`, `created_on`, `project_id`, `fixed_version_id`, `lock_version`, `subject`, `assigned_to_id`, `updated_on`, `done_ratio`, `tracker_id`, `category_id`, `due_date`, `story_id`, `description`, `status_id`, `author_id`) VALUES('2009-10-12', NULL, 5, '2009-10-12 13:06:14', 2, NULL, 0, 'eeeeee', NULL, '2009-10-12 13:06:14', 0, 13, NULL, NULL, NULL, '', 17, 1)

  def edit
    @allowed_statuses = @issue.new_statuses_allowed_to(User.current)
    @priorities = IssuePriority.all
    @edit_allowed = User.current.allowed_to?(:edit_issues, @project)
    @time_entry = TimeEntry.new

    @notes = params[:notes]
    journal = @issue.init_journal(User.current, @notes)
    # User can change issue attributes only if he has :edit permission or if a workflow transition is allowed
    if (@edit_allowed || !@allowed_statuses.empty?) && params[:issue]
      attrs = params[:issue].dup
      attrs.delete_if {|k,v| !UPDATABLE_ATTRS_ON_TRANSITION.include?(k) } unless @edit_allowed
      attrs.delete(:status_id) unless @allowed_statuses.detect {|s| s.id.to_s == attrs[:status_id].to_s}
      @issue.attributes = attrs
    end

    if request.post?
      @time_entry = TimeEntry.new(:project => @project, :issue => @issue, :user => User.current, :spent_on => Date.today)
      @time_entry.attributes = params[:time_entry]
      attachments = attach_files(@issue, params[:attachments])
      attachments.each {|a| journal.details << JournalDetail.new(:property => 'attachment', :prop_key => a.id, :value => a.filename)}
---
SELECT * FROM `issues` WHERE (id <> 78 and project_id=1) ORDER BY subject
SELECT count(*) AS count_all FROM `issues` WHERE (id=78 and status_id=18)
SELECT `issues`.* FROM `issues` INNER JOIN issue_pre_requirements ON issues.id = issue_pre_requirements.issue_pre_id WHERE ((`issue_pre_requirements`.issue_post_id = 78)) LIMIT 1
INSERT INTO `journal_details` (`property`, `prop_key`, `old_value`, `value`, `journal_id`) VALUES('attr', 'status_id', 17, 18, 72)
INSERT INTO `journals` (`created_on`, `notes`, `user_id`, `journalized_type`, `journalized_id`) VALUES('2009-10-22 20:39:43', '', 1, 'Issue', 78)
SELECT * FROM `attachments` WHERE (`attachments`.container_id = 47 AND `attachments`.container_type = 'Issue') ORDER BY attachments.created_on

  def find_issue
    @issue = Issue.find(params[:id], :include => [:project, :tracker, :status, :author, :priority, :category])
---
SELECT * FROM `trackers` WHERE (`trackers`.`id` = 13)
SELECT `issues`.id FROM `issues` INNER JOIN issue_pre_requirements ON issues.id = issue_pre_requirements.issue_pre_id WHERE (`issues`.`id` = 79) AND ((`issue_pre_requirements`.issue_post_id = 78)) LIMIT 1
SELECT `projects`.* FROM `projects` INNER JOIN members ON projects.id = members.project_id WHERE ((`members`.user_id = 1) AND ((projects.status=1)))