app/controllers/projects_controller.rb

  def index
    respond_to do |format|
      format.html {
        @projects = Project.visible.find(:all, :order => 'lft')
---
SELECT * FROM `projects` WHERE (projects.status=1 AND projects.is_public = 1) ORDER BY lft

  def show
    if params[:jump]
      # try to redirect to the requested menu item
      redirect_to_project_menu_item(@project, params[:jump]) && return
    end

    @users_by_role = @project.users_by_role
    @subprojects = @project.children.visible
    @news = @project.news.find(:all, :limit => 5, :include => [ :author, :project ], :order => "#{News.table_name}.created_on DESC")
    @trackers = @project.rolled_up_trackers

    cond = @project.project_condition(Setting.display_subprojects_issues?)

    @open_issues_by_tracker = Issue.visible.count(:group => :tracker,
      :include => [:project, :status, :tracker],
      :conditions => ["(#{cond}) AND #{IssueStatus.table_name}.is_closed=?", false])
    @total_issues_by_tracker = Issue.visible.count(:group => :tracker,
      :include => [:project, :status, :tracker],
      :conditions => cond)

    TimeEntry.visible_by(User.current) do
      @total_hours = TimeEntry.sum(:hours,
        :include => :project,
        :conditions => cond).to_f
---
SELECT * FROM `news` WHERE (`news`.project_id = 2) ORDER BY news.created_on DESC LIMIT 5
SELECT * FROM `users` WHERE ( (`users`.`type` = 'AnonymousUser' ) ) LIMIT 1
SELECT `projects`.* FROM `projects` INNER JOIN members ON projects.id = members.project_id WHERE ((`members`.user_id = 2) AND ((projects.status=1)))
SELECT count(DISTINCT `issues`.id) AS count_all, tracker_id AS tracker_id FROM `issues` LEFT OUTER JOIN `projects` ON `projects`.id = `issues`.project_id LEFT OUTER JOIN `issue_statuses` ON `issue_statuses`.id = `issues`.status_id LEFT OUTER JOIN `trackers` ON `trackers`.id = `issues`.tracker_id WHERE (((projects.id = 2 OR (projects.lft > 5 AND projects.rgt < 6))) AND issue_statuses.is_closed=0) AND (((projects.status=1 AND EXISTS (SELECT em.id FROM enabled_modules em WHERE em.name='issue_tracking' AND em.project_id=projects.id)) AND (1=0 OR projects.is_public = 1))) GROUP BY tracker_id
SELECT sum(`time_entries`.hours) AS sum_hours FROM `time_entries` LEFT OUTER JOIN `projects` ON `projects`.id = `time_entries`.project_id WHERE ((projects.id = 2 OR (projects.lft > 5 AND projects.rgt < 6))) AND (((projects.status=1 AND EXISTS (SELECT em.id FROM enabled_modules em WHERE em.name='time_tracking' AND em.project_id=projects.id)) AND (1=0)))

  def settings
    @issue_custom_fields = IssueCustomField.find(:all, :order => "#{CustomField.table_name}.position")
    @issue_category ||= IssueCategory.new
    @member ||= @project.members.new
    @trackers = Tracker.all
---
SELECT * FROM `custom_fields` WHERE ( (`custom_fields`.`type` = 'IssueCustomField' ) ) ORDER BY custom_fields.position
SELECT * FROM `trackers` ORDER BY position

  def add_version
  	@version = @project.versions.build(params[:version])
  	if request.post? and @version.save
---
INSERT INTO `versions` (`name`, `created_on`, `project_id`, `wiki_page_title`, `updated_on`, `description`, `effective_date`) VALUES('Iteração concluída', '2009-09-24 13:46:19', 2, '', '2009-09-24 13:46:19', '', '2009-09-23')

  def roadmap
    @trackers = @project.trackers.find(:all, :conditions => ["is_in_roadmap=?", true])
    retrieve_selected_tracker_ids(@trackers)
    @versions = @project.versions.sort
    @versions = @versions.select {|v| !v.completed? } unless params[:completed]
---
SELECT * FROM `trackers` INNER JOIN `projects_trackers` ON `trackers`.id = `projects_trackers`.tracker_id WHERE (`projects_trackers`.project_id = 1 AND (is_in_roadmap=1)) ORDER BY trackers.position
SELECT * FROM `versions` WHERE (`versions`.project_id = 1) ORDER BY versions.effective_date DESC, versions.name DESC

  def activity
    @days = Setting.activity_days_default.to_i

    if params[:from]
      begin; @date_to = params[:from].to_date + 1; rescue; end
    end

    @date_to ||= Date.today + 1
    @date_from = @date_to - @days
    @with_subprojects = params[:with_subprojects].nil? ? Setting.display_subprojects_issues? : (params[:with_subprojects] == '1')
    @author = (params[:user_id].blank? ? nil : User.active.find(params[:user_id]))

    @activity = Redmine::Activity::Fetcher.new(User.current, :project => @project,
      :with_subprojects => @with_subprojects,
      :author => @author)
    @activity.scope_select {|t| !params["show_#{t}"].nil?}
    @activity.scope = (@author.nil? ? :default : :all) if @activity.scope.empty?
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.status = 1)
SELECT * FROM `projects` WHERE (`projects`.`id` = 3)

  def find_project
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (projects.status = 1)