app/controllers/rules_controller.rb

SELECT * FROM `solutions` WHERE (`solutions`.`id` IN (1,2,3,4))
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.status = 1)
SELECT `rules`.id FROM `rules` WHERE (`rules`.`name` = BINARY 'PreRequirementStartRule') LIMIT 1
SELECT `solutions`.id FROM `solutions` WHERE (`solutions`.`name` = BINARY 'SolutionTddAssociatePreRequirement' AND `solutions`.id <> 1) LIMIT 1
---
  def create
    @issue = @project.issues.find params[:id]
    @rule = @project.rules.find params[:rule_id]
    @solution = @rule.solutions.find params[:solution_id]
    @solution.name.constantize::create :project=>@project,:issue=>@issue,:params=>params, :current_user=>User.find(session[:user_id])