app/controllers/rules_controller.rb

SELECT * FROM `rules` ORDER BY name
---
  def index
    @rules = Rule.find :all, :order=>"name"

SELECT * FROM `rules` WHERE (`rules`.`id` = 14)
---
  def show
    @rule = Rule.find params[:id]

INSERT INTO `rules` (`name`, `importance`, `created_at`, `process_type`, `updated_at`, `action`, `context`, `message`) VALUES('PreRequirementStartRule', 'low', '2009-10-29 01:04:52', 'Issue', '2009-10-29 01:04:52', 'update', 'Uma tarefa não deve ser iniciada sem seu pré-requisito ser iniciada', NULL)
---
  def create
    @rule = Rule.new params[:rule]
    @rule.solution_ids = params[:solutions]
    if @rule.save

SELECT * FROM `rules` WHERE (`rules`.`id` = 14)
---
  def edit
    @rule = Rule.find params[:id]

SELECT * FROM `rules` WHERE (`rules`.`id` = 19)
UPDATE `rules` SET `updated_at` = '2009-10-29 01:18:01', `context` = 'Uma tarefa não deve ser iniciada sem seu pré-requisito ser iniciado' WHERE `id` = 20
---
  def update
    @rule = Rule.find params[:id]
    @rule.solution_ids = params[:solutions]
    if @rule.update_attributes(params[:rule])

SELECT `issues`.* FROM `issues` INNER JOIN issue_pre_requirements ON issues.id = issue_pre_requirements.issue_pre_id WHERE ((`issue_pre_requirements`.issue_post_id = 88)) LIMIT 1
---
  def list
    @issue = @project.issues.find params[:id]

SELECT `issues`.* FROM `issues` INNER JOIN issue_pre_requirements ON issues.id = issue_pre_requirements.issue_pre_id WHERE ((`issue_pre_requirements`.issue_post_id = 88)) LIMIT 1
SELECT `rules`.* FROM `rules` INNER JOIN project_rules ON rules.id = project_rules.rule_id WHERE (`rules`.`id` = 11 AND ((`project_rules`.project_id = 1)))
SELECT `solutions`.* FROM `solutions` INNER JOIN rule_solutions ON solutions.id = rule_solutions.solution_id WHERE (`solutions`.`id` = 2 AND ((`rule_solutions`.rule_id = 15)))
INSERT INTO `issues` (`start_date`, `estimated_hours`, `priority_id`, `created_on`, `project_id`, `fixed_version_id`, `lock_version`, `subject`, `assigned_to_id`, `updated_on`, `done_ratio`, `tracker_id`, `category_id`, `due_date`, `story_id`, `description`, `status_id`, `author_id`) VALUES('2009-10-12', NULL, 5, '2009-10-12 13:08:01', 2, NULL, 0, '[Teste] eeee', NULL, '2009-10-12 13:08:15', 0, 14, NULL, NULL, NULL, '', 17, 1)
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.status = 1)
---
  def execute
    @issue = @project.issues.find params[:id]
    @rule = @project.rules.find params[:rule_id]
    @solution = @rule.solutions.find params[:solution_id]
    @solution.name.constantize::create :project=>@project,:issue=>@issue,:params=>params, :current_user=>User.find(session[:user_id])

SELECT * FROM `rules` WHERE (`rules`.`id` = 11)
DELETE FROM `rules` WHERE `id` = 11
---
  def destroy
    @rule = Rule.find params[:id]
    Rule.destroy(@rule.id)

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
---
  def find_project
    @project = Project.find(params[:project_id])