app/controllers/solutions_controller.rb

  def show
    @solution = Solution.find(params[:id])
---
SELECT * FROM `solutions` WHERE (`solutions`.`id` = 11)

  def edit
    @solution = Solution.find(params[:id])
---
SELECT * FROM `solutions` WHERE (`solutions`.`id` = 1)

  def create
    @solution = Solution.new(params[:solution])

    respond_to do |format|
      if @solution.save
---
INSERT INTO `solutions` (`name`, `created_at`, `updated_at`, `message`, `rule_id`) VALUES('SolutionDoNothing', '2009-10-12 12:21:33', '2009-10-12 12:21:33', 'Não executa nenhuma ação e ignora a regra', NULL)

  def destroy
    @solution = Solution.find(params[:id])
    @solution.destroy
---
SELECT * FROM `solutions` WHERE (`solutions`.`id` = 8)
DELETE FROM `solutions` WHERE `id` = 8