app/controllers/stories_controller.rb

  def index
    @stories = @project.stories.find(:all)
---
SELECT * FROM `stories` WHERE (`stories`.project_id = 1)

  def show
    @story = @project.stories.find(params[:id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1 AND (`stories`.project_id = 1))

  def edit
    @story = @project.stories.find(params[:id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1 AND (`stories`.project_id = 1))

  def create
    @story = Story.new(params[:story])
    @story.project = @project
    @story.author = User.current
    respond_to do |format|
      if @story.save
---
INSERT INTO `stories` (`created_at`, `title`, `project_id`, `updated_at`, `version_id`, `author_id`, `description`, `approval_criteria`) VALUES('2009-10-25 18:21:13', 'Grupo de Regras', 3, '2009-10-25 18:21:13', 4, 1, 'O sistema deve possuir um grupo de regras totalmente dinâmicas, com facilidade para serem incluídas, excluídas e alteradas.\r\n', 'As regras devem estar criadas; o código deve estar testado com cobertura de código de, no mínimo, 70%; a documentação das regras deve estar criada, cobrindo a arquitetura, exemplos de alteração das regras e de criação de novas regras.\r\n')

  def update
    @story = @project.stories.find(params[:id])

    @story.author = User.current
    respond_to do |format|
      if @story.update_attributes(params[:story])
        if !@story.invalid_rules.empty?
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1 AND (`stories`.project_id = 1))
UPDATE `stories` SET `updated_at` = '2009-09-30 17:23:37', `approval_criteria` = 'soijaoidjsaojid\r\ndoasijdosaijdoisaj\r\nasodijsoaijdoaij\r\nsoaijoaij' WHERE `id` = 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.status = 1)